#### Terraform Plan 📝 for `prod/base/terraform`
<details><summary>Show Plan</summary>

```

aws_dynamodb_table.tfg_tf_locks: Refreshing state... [id=tfg-terraform-locks]
aws_s3_bucket.tfg_states_bucket: Refreshing state... [id=tfg-terraform-states]
aws_s3_bucket_versioning.states_versioning: Refreshing state... [id=tfg-terraform-states]
aws_s3_bucket_public_access_block.states_access_block: Refreshing state... [id=tfg-terraform-states]
aws_s3_bucket_policy.states_bucket_policy: Refreshing state... [id=tfg-terraform-states]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.states_bucket_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "states_bucket_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::tfg-terraform-states",
              + "arn:aws:s3:::tfg-terraform-states/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::522922866161:role/tfg-repo-base-cicd",
                  + "arn:aws:iam::522922866161:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteBucket",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::tfg-terraform-states",
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_s3_bucket.tfg_states_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "tfg_states_bucket" {
        id                          = "tfg-terraform-states"
      ~ tags                        = {
          ~ "Ownership" = "jordi" -> "estif"
            "Stage"     = "prod"
            "Terraform" = "true"
        }
      ~ tags_all                    = {
          ~ "Ownership" = "jordi" -> "estif"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.states_bucket_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "states_bucket_policy" {
        id     = "tfg-terraform-states"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::522922866161:root",
                              - "arn:aws:iam::522922866161:role/tfg-repo-base-cicd",
                            ]
                        }
                      - Resource  = [
                          - "arn:aws:s3:::tfg-terraform-states/*",
                          - "arn:aws:s3:::tfg-terraform-states",
                        ]
                    },
                  - {
                      - Action    = "s3:DeleteBucket"
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:s3:::tfg-terraform-states"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: workspace.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "workspace.plan"

```

</details>

*Pushed by: @JordiiBru, Action: pull_request in Path: `prod/base/terraform`*